app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (name ilike '%g%')
---
  def index
    @recipes = if params[:keywords]
                 Recipe.where('name like ?', "%#{params[:keywords]}%")